Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Ant build completed with {0, choice, 0#no errors|1#one error|2#{0} errors} and {1, choice, 0#no warnings|1#one warning|2#{1} warnings} in {2} at {3}
zh_cn: Ant 构建完成，有 {0, choice, 0#no errors|1#one error|2#{0} errors} 和 {1, choice, 0#no warnings|1#one warning|2#{1} warnings} 在 {2} {3}

source: Ant build completed with {0, choice, 0#no warnings|1#one warning|2#{0} warnings} in {1} at {2}
zh_cn: Ant 构建完成，有 {0, choice, 0#no warnings|1#one warning|2#{0} warnings} 在 {1} {2}

source: Ant build files successfully generated: {0}
zh_cn: Ant 构建文件成功生成: {0}

source: Ant build started
zh_cn: Ant 构建开始

source: Ant buildfiles
zh_cn: Ant 构建文件

source: Ant command &line:
zh_cn: Ant 命令行:(&L)

source: Ant inspections
zh_cn: Ant 检查

source: Ant installation is not configured.
zh_cn: Ant 安装未配置。

source: Ant process from the same build file is active.
zh_cn: 来自相同构建文件的 Ant 进程处于活动状态。

source: Ant project name
zh_cn: Ant 项目名称

source: Ant properties declaration
zh_cn: Ant 属性声明

source: Ant property
zh_cn: Ant 属性

source: Ant support features
zh_cn: Ant 支持功能

source: Ant target
zh_cn: Ant 目标

source: Ant task
zh_cn: Ant 任务

source: Antialiasing
zh_cn: 抗锯齿

source: Any exception
zh_cn: 任何异常

source: Any var
zh_cn: 任何变量

source: Anywhere
zh_cn: 在任何地方

source: Apache Ant version {0}
zh_cn: Apache Ant 版本 {0}

source: Appearance
zh_cn: 外观

source: Appearance \& Behavior
zh_cn: 外观 \& 行为

source: Append
zh_cn: 追加

source: Append Left Side
zh_cn: 附加左侧

source: Append Right Side
zh_cn: 附加右侧

source: Append default children
zh_cn: 添加默认 children

source: Applet &class:
zh_cn: Applet 类:(&C)

source: Applet Class
zh_cn: Applet 类

source: Applet Parameters
zh_cn: Applet 参数

source: Applet configuration
zh_cn: Applet 配置

source: Applicable to: {0}
zh_cn: 适用于:{0}

source: Applied to new files
zh_cn: 应用于新文件

source: Apply All Non-Conflicting Changes
zh_cn: 应用所有不冲突的更改

source: Apply Changes
zh_cn: 应用更改

source: Apply Non-Conflicting Changes from the Left Side
zh_cn: 从左侧应用不冲突的更改

source: Apply Non-Conflicting Changes from the Right Side
zh_cn: 从右侧应用不冲突的更改

source: Apply Patch
zh_cn: 应用补丁

source: Apply Patch from Clipboard...
zh_cn: 从剪贴板应用补丁...

source: Apply Patch...
zh_cn: 应用补丁...

source: Apply a patch to the sources of the project
zh_cn: 应用补丁到项目的源代码

source: Apply a quickfix
zh_cn: 应用快速修复

source: Apply an inspection quickfix
zh_cn: 应用一个检查快速修复

source: Apply constraint within type hierarchy
zh_cn: 在类型层次中应用约束

source: Apply conversion ''.toArray({0})''
zh_cn: 应用转换 ''.toArray({0})''

source: Apply conversion '.toArray()'
zh_cn: 应用转换 '.toArray()'

source: Apply current layout
zh_cn: 应用当前的布局

source: Apply editor font settings
zh_cn: 应用编辑器字体设置

source: Apply renderer to objects of type (fully-qualified name):
zh_cn: 将渲染器应用到类型的对象(完全限定名):

source: Apply saved changes to current codebase
zh_cn: 将保存的更改应用于当前代码库

source: Apply selected change side
zh_cn: 应用所选一边的更改

source: Apply the reverse of the selected changes to the working copy
zh_cn: 将选中更改的反向应用于工作副本

source: Archive
zh_cn: 存档

source: Archive files
zh_cn: 存档文件

source: Are you sure to remove selected configuration(s)?
zh_cn: 您确定要移除所选配置吗？

source: Are you sure to remove selected run configuration(s)?
zh_cn: 您确定移除所选的运行配置吗？

source: Are you sure want to remove changelist ''{0}''?
zh_cn: 你确定要移除更改列表 ''{0}'' 吗？

source: Are you sure want to remove {0} changelists?
zh_cn: 你确定要移除更改列表 {0} 吗？

source: Are you sure you want to continue?
zh_cn: 您确定要继续吗？

source: Are you sure you want to delete all selected libraries?
zh_cn: 您确定要删除所有选定的库吗？

source: Are you sure you want to delete folder ''{0}''?
zh_cn: 您确定要删除文件夹 ''{0}'' 吗？

source: Are you sure you want to delete {0} selected directories?
zh_cn: 您确定要删除 {0} 所选目录吗？

source: Are you sure you want to delete {0} selected files and directories?
zh_cn: 您确定要删除 {0} 所选文件和目录吗？

source: Are you sure you want to delete {0} selected files?
zh_cn: 您确定要删除 {0} 所选文件吗？

source: Are you sure you want to discard your changes and accept {0, choice, 0#left|1#right} side?
zh_cn: 你确定你要放弃更改并接受 {0, choice, 0#左|1#右} 边吗?

source: Are you sure you want to exit without applying changes?
zh_cn: 您确定不应用更改就退出吗？

source: Are you sure you want to exit {0}?
zh_cn: 确定要退出 {0} 吗?

source: Are you sure you want to remove it?
zh_cn: 您确定要移除它吗？

source: Are you sure you want to remove {0, choice, 1#the only module|2#all modules} from this project?
zh_cn: 你确定要从项目中移除{0, choice, 1#唯一一个|2#所有的}模块吗？

source: Are you sure you want to save changes and finish merging?
zh_cn: 您确定要保存更改并完成合并吗？

source: Are you sure you want to save changes and finish resolve?
zh_cn: 您确定要保存更改并完成解决吗？

source: Are you sure you want to stop them and exit {0}?
zh_cn: 确定要停止它们，退出 {0} 吗?

source: Are you sure you want to stop {1, choice, 1#the running one|2#{1, number} running instances}?
zh_cn: 你确定要停止正在运行的 {1, choice, 1#1个|2#{1, number} 个}实例吗?

source: Are you sure you wish to continue?
zh_cn: 您确定要继续吗？

source: Are you sure you would like to view the entire history of the project?
zh_cn: 你确定要查看项目的整个历史吗？

source: Argument <code>#ref</code> #loc might be null
zh_cn: 参数 <code>#ref</code> #loc 可能为 null

source: Argument is not an array type
zh_cn: 参数不是数组类型

source: Argument is not assignable to ''{0}''
zh_cn: 参数不能赋给 ''{0}''

source: Argument of type ''{0}'' cannot be ''null''
zh_cn: ''{0}'' 类型的参数不能为 ''null''

source: Argument type should be exactly ''{0}''
zh_cn: 参数类型应该完全是 ''{0}''

source: Around "=" in attribute
zh_cn: 在属性中 "=" 周围

source: Around Operators
zh_cn: 运算符周围

source: Around class:
zh_cn: 类周围:

source: Around field:
zh_cn: 字段周围:

source: Around initializer:
zh_cn: 初始化周围:

source: Around method:
zh_cn: 方法周围:

source: Arrangement
zh_cn: 排列

source: Array <code>#ref</code> is always empty
zh_cn: 数组 <code>#ref</code> 总是空

source: Array access <code>#ref</code> #loc may produce <code>java.lang.NullPointerException</code>
zh_cn: 数组访问 <code>#ref</code> #loc 可能产生 <code>java.lang.NullPointerException</code>

source: Array has been collected
zh_cn: 数组已经被回收

source: Array index is out of bounds
zh_cn: 数组索引越界

source: Array initializer
zh_cn: 数组初始化

source: Array initializer braces
zh_cn: 数组初始化大括号

source: Array initializer expected
zh_cn: 期望数组初始化器

source: Array initializer is not allowed here
zh_cn: 这里不允许使用数组初始化器

source: Array initializer left brace
zh_cn: 数组初始化左大括号

source: Array item is not assignable to ''{0}''
zh_cn: 数线元素不能赋值给 ''{0}''

source: Array reference expected
zh_cn: 预期数组引用

source: Array sta&rt index:
zh_cn: 数组起始索引：(&R)

source: Array type expected
zh_cn: 预期数组类型

source: Array type expected; found: ''{0}''
zh_cn: 期望数组类型;找到：''{0}''

source: Array types are incompatible: arrays are always different
zh_cn: 数组类型不兼容：数组总是不同的

source: Array {0,choice,1#item has|1<items have} incompatible {0,choice,1#type|1<types}
zh_cn: 数组元素不兼容

source: Artifact
zh_cn: 构件

source: As a result, such a file will be ignored by indexing, inspection and code completion.
zh_cn: 这样的话，这样的文件将被索引，检查和代码补全所忽略。

source: As of Java 9, '_' is a keyword, and may not be used as an identifier
zh_cn: 从 Java 9 开始， '_' 是一个关键字，不能用作标识符

source: As you type the name of the task you want to run, the lookup list shrinks to show the matching entries only.
zh_cn: 当您键入要运行的任务的名称时，查找列表将缩小以仅显示匹配的条目。

source: As you type the name of the utility you want to run, the lookup list shrinks to show the matching entries only.
zh_cn: 在输入要运行的实用程序的名称时，查阅列表将缩小以仅显示匹配的条目。

source: As {0}
zh_cn: 为 {0}

source: As&k
zh_cn: 询问(&K)

source: Ask
zh_cn: 询问

source: Aspects
zh_cn: 方面

source: Assert
zh_cn: 断言

source: Assert ''{0}''
zh_cn: 断言 ''{0}''

source: Assert False Methods
zh_cn: 断言 False 方法

source: Assert IsNotNull Methods
zh_cn: 断言 IsNotNull 方法

source: Assert IsNull Methods
zh_cn: 断言 IsNull 方法

source: Assert True Methods
zh_cn: 断言 True 方法

source: Assert statement
zh_cn: Assert 语句

source: Assert/Check Method Configuration
zh_cn: 断言/检查方法配置

source: Assertion
zh_cn: 断言

source: Assertion failed
zh_cn: 断言失败

source: Assign Parameter to Field
zh_cn: 将参数分配给字段

source: Assign Parameter to Field ''{0}''
zh_cn: 将参数分配给 ''{0}'' 字段

source: Assign Shortcut...
zh_cn: 分配快捷键...

source: Assign short description for the bookmark to be shown along the file name
zh_cn: 为书签指定简短描述，将沿文件名显示

source: Assigned to {0}
zh_cn: 分配到 {0}

source: Assignment issues
zh_cn: 赋值问题

source: Assignment operators (=, +=, ...)
zh_cn: 赋值运算符 (=, +=, ...)

source: Assignment sign on next line
zh_cn: 赋值符号在下一行

source: Assignment statement
zh_cn: 赋值语句

source: Assignments
zh_cn: 赋值

source: Associate
zh_cn: 关联

source: Associate a new label with {0} element
zh_cn: 将新标签与 {0} 元素相关联

source: Associate selected file with one of file types
zh_cn: 将选定的文件关联到某种文件类型

source: Associate with File Type
zh_cn: 关联文件类型

source: Async Stacktraces
zh_cn: 异步堆栈跟踪

source: Async stacktrace
zh_cn: 异步堆栈跟踪

source: At this stage {0} can analyze usages of {1} and replace them with usages of {2} where possible.
zh_cn: 在这个阶段 {0} 可以分析 {1} 的使用 并在可能的情况下用 {2} 的使用替换。

source: Attach
zh_cn: 附加

source: Attach &Files or Directories...
zh_cn: 附加文件或目录...(&F)

source: Attach &Sources...
zh_cn: 附加源...(&S)

source: Attach Files or Directories
zh_cn: 附加文件或目录

source: Attach Files or Directories to Library ''{0}''
zh_cn: 将文件或目录附加到库 ''{0}''

source: Attach Sources
zh_cn: 附加源

source: Attach To
zh_cn: 附加到

source: Attach selected views to the debugger tool window
zh_cn: 将选中视图附加到调试器工具窗口

source: Attach to Local Process...
zh_cn: 附加到本地进程...

source: Attach to a locally running process with an available debugger
zh_cn: 使用可用的调试器连接到本地运行的进程

source: Attach with {0} To
zh_cn: 用 {0} 附加到

source: Attach {0} Views
zh_cn: 附加 {0} 视图

source: Attaching...
zh_cn: 附加...

source: Attachments
zh_cn: 附件

source: Attempt to modify read-only document
zh_cn: 试图修改只读文档

source: Attempting to delete
zh_cn: 试图删除

source: Attr default:\&nbsp;required
zh_cn: 属性默认值:\&nbsp;必须的

source: Attr type:\&nbsp;{0}
zh_cn: 属性类型:\&nbsp;{0}

source: Attribute ''{0}'' is not allowed here
zh_cn: 属性 ''{0}'' 在这里不允许

source: Attribute ''{0}'' should have an integer value
zh_cn: 属性 ''{0}'' 应该有一个整数值

source: Attribute name
zh_cn: 属性名

source: Attribute value
zh_cn: 属性值

source: Attribute value expected
zh_cn: 期望属性值

source: Attribute value is not closed
zh_cn: 属性值未关闭

source: Attribute value must be a class literal
zh_cn: 属性值必须是一个类文字

source: Attribute value must be an enum constant
zh_cn: 属性值必须是枚举常量

source: Attribute value must be constant
zh_cn: 属性值必须是常量

source: Attribute {0} is not allowed here
zh_cn: 属性 {0} 不允许在这里

source: Attribute {0} is not allowed here when element reference is used
zh_cn: 当使用元素引用时，属性 {0} 不允许在此处

source: Attribute {0} is not boolean
zh_cn: 属性 {0} 不是布尔值

source: Author
zh_cn: 作者

source: Auto
zh_cn: 自动

source: Auto Import
zh_cn: 自动导入

source: Auto Scroll to Source
zh_cn: 自动滚动到源码

source: Auto Show
zh_cn: 自动显示

source: Auto populate Throwable object's stacktrace
zh_cn: 自动填充 Throwable 对象的堆栈跟踪

source: Auto-Variables Mode
zh_cn: 自动变量模式

source: Auto-detect proxy settings
zh_cn: 自动检测代理设置

source: Auto-display code completion
zh_cn: 自动显示代码补全

source: Auto-display documentation in
zh_cn: 自动显示文档在

source: Auto-display parameter info in
zh_cn: 自动显示参数信息在

source: Auto-insert when only one choice on:
zh_cn: 当只有一种选择时自动完成：

source: Autocomplete common prefix
zh_cn: 自动补全常见的前缀

source: Automatic Labeling on
zh_cn: 自动贴标签

source: Automatic checks of files in editor with Rubocop.
zh_cn: 使用 Rubocop 自动检查编辑器中的文件。

source: Automatic proxy configuration URL:
zh_cn: 自动代理配置 URL：

source: Automatically check updates for
zh_cn: 自动检查更新

source: Automatically insert closing tag
zh_cn: 自动插入关闭标签

source: Automatically show first &error in editor
zh_cn: 自动显示编辑器中的第一个错误(&E)

source: Autopopup documentation in (ms):
zh_cn: 自动弹出文档在(毫秒):

source: Autopopup in (ms):
zh_cn: 自动弹出在(毫秒):

source: Autopopup:
zh_cn: 自动弹窗:

source: Autoreparse delay (ms):
zh_cn: 自动重分析延时(毫秒):

source: Autoscroll from Source
zh_cn: 从源代码自动滚动

source: Autoscroll to Source
zh_cn: 自动滚动到源代码

source: Autoscroll to new &local variables
zh_cn: 自动滚动到新的局部变量(&L)

source: Available
zh_cn: 可用

source: Available options are:
zh_cn: 可用选项有：

source: Average usage frequency
zh_cn: 平均使用频率

source: Back
zh_cn: 后退

source: Background
zh_cn: 后台

source: Background Operations
zh_cn: 后台操作

source: Background Tasks
zh_cn: 后台任务

source: Background processes
zh_cn: 后台进程

source: Backspace
zh_cn: 退格

source: Backspace smart indent
zh_cn: 退格智能缩进

source: Backup previously generated files
zh_cn: 备份以前生成的文件

source: Backward Dependencies (Usages)
zh_cn: 反向的依赖关系(用法)

source: Backward Dependencies of {0}
zh_cn: {0} 的反向依赖

source: Backward Dependency Analysis
zh_cn: 反向依赖分析

source: Backward Reference Indices Validation
zh_cn: 反向引用索引验证

source: Bad character
zh_cn: 坏字符

source: Bad class file format: {0}
zh_cn: 错误的类文件格式: {0}

source: Bad file mask "{0}"
zh_cn: 错误的文件掩码 "{0}"

source: Bad pattern "{0}": {1}
zh_cn: 错误的模式 "{0}": {1}

source: Bad quotation for ''{0}''
zh_cn: 对 ''{0}'' 无效的引用

source: Bad type qualifier in default super call: {0}
zh_cn: 默认 super 调用中的错误类型限定符：{0}

source: Balloon Layout
zh_cn: 气球布局

source: Base Ctr call
zh_cn: 基础控制调用

source: Base On This Method
zh_cn: 基于此方法

source: Base On This Type
zh_cn: 基于该类型

source: Base Version
zh_cn: 基本版本

source: Base on This Class
zh_cn: 基于此类

source: Base on This Interface
zh_cn: 基于此接口

source: Base on This Method
zh_cn: 基于此方法

source: Base revision
zh_cn: 基本修订

source: Base version
zh_cn: 基本版本

source: Based on keymap: {0}
zh_cn: 基于快捷键映射:{0}

source: Based on {0} keymap
zh_cn: 基于 {0} 快捷键

source: Basic Completion
zh_cn: 基本补全

source: Basic code completion
zh_cn: 基本代码补全

source: Basic options
zh_cn: 基本选项

source: Bean Property
zh_cn: Bean 属性

source: Bean info classes
zh_cn: Bean 信息类

source: Before ':'
zh_cn: 在 ':' 前

source: Before '?'
zh_cn: 在 '?' 前

source: Before '}':
zh_cn: 在 '}' 前:

source: Before Compilation
zh_cn: 编译前

source: Before Keywords
zh_cn: 关键字之前

source: Before Left Brace
zh_cn: 左括号之前

source: Before Parentheses
zh_cn: 括号之前

source: Before Run/Debug
zh_cn: 运行/调试之前

source: Before Run/Debug...
zh_cn: 运行/调试之前...

source: Before comma
zh_cn: 逗号之前

source: Before imports:
zh_cn: 导入前:

source: Before method body:
zh_cn: 方法主体前:

source: Before opening angle bracket
zh_cn: 在打开尖括号之前

source: Before package statement:
zh_cn: 包语句前:

source: Before semicolon
zh_cn: 分号之前

source: Before {0}
zh_cn: 在 {0} 前

source: Before:
zh_cn: 之前：

source: Behavior
zh_cn: 行为

source: Besides recent files, you can bring up results of the usage searches you have performed recently.
zh_cn: 除了最近的文件，您还可以找出最近执行的使用搜索结果。

source: Bidi Text Direction
zh_cn: Bidi 文本方向

source: Binary
zh_cn: 二进制

source: Binary expressions
zh_cn: 二元表达式

source: Binary files are different
zh_cn: 二进制文件不同

source: Binary files are identical
zh_cn: 二进制文件相同

source: Binary literals
zh_cn: 二进制文字

source: Binary numbers must contain at least one binary digit
zh_cn: 二进制数字必须至少包含一个二进制数字

source: Binary operation
zh_cn: 二元运算

source: Binary versions are different
zh_cn: 二进制版本是不同的

source: Binary versions are identical
zh_cn: 二进制版本是相同的

source: Binary versions differ
zh_cn: 二进制版本不同

source: Bind parameters to fields
zh_cn: 将参数绑定到字段

source: Bind {0} parameters to fields
zh_cn: 将 {0} 参数绑定到字段

source: Bitwise operation issues
zh_cn: 按位操作问题

source: Bitwise operators (\&, |, ^)
zh_cn: 按位运算符 (\&, |, ^)

source: Blank Lines
zh_cn: 空行

source: Blank lines
zh_cn: 空行

source: Block
zh_cn: 块

source: Block comment
zh_cn: 块注释

source: Block comment at first column
zh_cn: 注释块在第一列

source: Block comment end:
zh_cn: 块注释结束:

source: Block comment start:
zh_cn: 块注释开始:

source: Bold
zh_cn: 粗体

source: Bold Underscored
zh_cn: 加粗下划线

source: Boo_kmarks
zh_cn: 书签(_K)

source: Bookmark Description
zh_cn: 书签描述

source: Bookmarks
zh_cn: 书签

source: Boolean expression expected
zh_cn: 期望布尔表达式

source: Boolean method <code>#ref</code> is always inverted
zh_cn: 布尔方法 <code>#ref</code> 总是反转的

source: Boolean method is always inverted
zh_cn: 布尔方法总是反转

source: Boolean value according to the performed compilation: true for make, false for force recompile
zh_cn: 对应执行的编译的布尔值：true 表示 make ，false 表示强制重新编译

source: Boolean value expected
zh_cn: 预期布尔值

source: Bordered
zh_cn: 描边

source: Bound Value:
zh_cn: 绑定值:

source: Braces Placement
zh_cn: 括号布置

source: Braces and Operators//Braces
zh_cn: 括号和操作符//大括号

source: Braces and Operators//Brackets
zh_cn: 括号和操作符//中括号

source: Braces and Operators//Comma
zh_cn: 括号和操作符//逗号

source: Braces and Operators//Dot
zh_cn: 括号和操作符//点

source: Braces and Operators//Operation sign
zh_cn: 括号和操作符//操作符号

source: Braces and Operators//Operator sign
zh_cn: 括号和操作符//运算符符号

source: Braces and Operators//Parentheses
zh_cn: 括号和操作符//小括号

source: Braces and Operators//Semicolon
zh_cn: 括号和操作符//分号

source: Braces placement
zh_cn: 括号布置

source: Brackets
zh_cn: 方括号

source: Brackets:
zh_cn: 括号:

source: Branch
zh_cn: 分支

source: Breadcrumbs
zh_cn: 面包屑导航

source: Break outside switch or loop
zh_cn: Break 外部 switch 或 loop

# Break string on ' '
source: Break string on '\n'
zh_cn: 在 '\n' 上断开字符串

source: Breakpoint Action Error
zh_cn: 断点操作错误

source: Breakpoint Actions
zh_cn: 断点操作

source: Breakpoint Condition Error
zh_cn: 断点条件错误

source: Breakpoint at line {0}
zh_cn: 断点在行 {0}

source: Breakpoint does not belong to any class
zh_cn: 断点不属于任何类

source: Breakpoint line
zh_cn: 断点行

source: Breakpoint reached
zh_cn: 断点到达

source: Breakpoint reached at {0}
zh_cn: 断点到达 {0}

source: Breakpoint reached at {0}({1}:{2,number,#})
zh_cn: 断点到达 {0}({1}:{2,number,#})

source: Breakpoint reached in thread {0}
zh_cn: 继点在线程 {0} 中到达

source: Breakpoint reached:
zh_cn: 断点到达:

source: Breakpoints
zh_cn: 断点

source: Breakpoints will be ignored for the obsolete version of the method
zh_cn: 对于该方法的过时版本，断点将被忽略

source: Breakpoints will be unavailable in this class.
zh_cn: 该类将不能使用断点。

source: Bring ''{0}'' into scope
zh_cn: 将 ''{0}'' 引入范围

source: Bring Variable to Scope
zh_cn: 将变量带到范围

source: Broken link
zh_cn: 无效连接

source: Browse
zh_cn: 浏览

source: Browse Call Hierarchy
zh_cn: 浏览调用层次结构

source: Browse Changes
zh_cn: 浏览更改

source: Browse Changes...
zh_cn: 浏览更改...

source: Browse Console History
zh_cn: 浏览控制台历史记录

source: Browse Icon
zh_cn: 浏览图标

source: Browse Method Hierarchy
zh_cn: 浏览方法层次结构

source: Browse Output directory
zh_cn: 浏览输出目录

source: Browse Type Hierarchy
zh_cn: 浏览类型层次结构

source: Browse VCS Repository
zh_cn: 浏览 VCS 仓库

source: Browse call hierarchy for the selected method
zh_cn: 浏览选中方法的调用层次结构

source: Browse code chosen analysis item depends on
zh_cn: 浏览选中代码分析依赖的项目

source: Browse code chosen analysis item used in
zh_cn: 浏览选中代码分析用于的项目

source: Browse code chosen analysis item used in cycles
zh_cn: 浏览选中代码分析循环依赖的项目

source: Browse console history
zh_cn: 浏览控制台历史记录

source: Browse directory
zh_cn: 浏览目录

source: Browse external documentation
zh_cn: 浏览外部文档

source: Browse for local file
zh_cn: 浏览本地文件

source: Browse hierarchy for the selected class
zh_cn: 浏览选中类的层次结构

source: Browse icon for selected action (*.png)
zh_cn: 为选中的操作指定一个图标 (*.png)

source: Browse method hierarchy for the selected method
zh_cn: 浏览选中方法的层次结构

source: Browser Error
zh_cn: 浏览器错误

source: Browser Not Found
zh_cn: 浏览器未找到

source: Build
zh_cn: 构建

source: Build #{0}
zh_cn: 构建 #{0}

source: Build ''{0}'' artifact
zh_cn: 构建 ''{0}'' 构件

source: Build All Artifacts
zh_cn: 构建所有构件

source: Build Artifact
zh_cn: 构建构件

source: Build Artifacts
zh_cn: 构建构件

source: Build File Properties
zh_cn: 构建文件属性

source: Build JARs on b&uild
zh_cn: 在构建时构建 JAR(&U)

source: Build Project
zh_cn: 构建项目

source: Build Selected _Modules
zh_cn: 构建所选模块(_M)

source: Build Tools
zh_cn: 构建工具

source: Build _Module
zh_cn: 构建模块(_M)

source: Build _Project
zh_cn: 构建项目(_P)

source: Build initialization
zh_cn: 构建初始化

source: Build number
zh_cn: 构建编号:

source: Build project before reloading classes
zh_cn: 在重新加载类之前构建项目

source: Build sequence {0}
zh_cn: 构建序列 {0}

source: Build {0} artifacts
zh_cn: 构建 {0} 构件

source: Build, Execution, Deployment
zh_cn: 构建，执行，部署

source: Build, no error check
zh_cn: 构建，无错误检查

source: Build:
zh_cn: 构建:

source: Building dependencies graph
zh_cn: 构建依赖关系图

source: Building exclude roots...
zh_cn: 构建排除根...

source: Building include indices...
zh_cn: 构建包含的索引...

source: Building search index
zh_cn: 构建搜索索引

source: Built-in file encoding (e.g. JSP, HTML or XML) overrides encoding you specify here.
zh_cn: 内置文件编码(例如 JSP，HTML 或 XML)会覆盖您在此处指定的编码。

source: Built-in server
zh_cn: 内置服务器

source: Bundled Ant
zh_cn: 捆绑 Ant

source: Bundled Plugins:
zh_cn: 捆绑的插件:

source: By Scope
zh_cn: 基于范围

source: By default expand with
zh_cn: 默认展开通过

source: By line
zh_cn: 按行

source: By pressing &shortcut:ChooseRunConfiguration; you can access the Run/Debug dropdown on the main toolbar, without the need to use your mouse.
zh_cn: 按下 &shortcut:ChooseRunConfiguration; ，你可以在菜单工具栏中进入运行/调试下拉框，而不需要使用鼠标。

source: By word
zh_cn: 按词

source: C&lass
zh_cn: 类(&L)

source: C&lass filters:
zh_cn: 类过滤器:(&L)

source: C&leanup
zh_cn: 清理(&L)

source: C&lear output directory on rebuild
zh_cn: 在重建时清除输出目录(&L)

source: C&ompile in background
zh_cn: 在后台编译(&O)

source: C&ontext:
zh_cn: 上下文：(&O)

source: C_hange under caret
zh_cn: 修改插入符号处(_H)

source: C_heck Project Status
zh_cn: 检查项目状态(_H)

source: C_lose
zh_cn: 关闭(_L)

source: C_onvert To Instance Method...
zh_cn: 转换为实例方法...(_O)

source: C_opy Path
zh_cn: 复制路径(_O)

source: C_opy Paths
zh_cn: 复制路径(_O)

source: C_opy...
zh_cn: 复制...(_O)

source: Ca&ncel
zh_cn: 取消(&N)

source: Calculating changes...
zh_cn: 计算更改...

source: Calculating number of pages...
zh_cn: 计算页数...

source: Call Hierarch_y
zh_cn: 调用层次结构(_Y)

source: Call arguments
zh_cn: 调用参数

source: Call chain
zh_cn: 调用链

source: Call receiver is 'null'
zh_cn: 调用接收器是 'null'

source: Call receiver type is incompatible: ''{0}'' is expected
zh_cn: 调用接收器类型不兼容：期望 ''{0}''

source: Call to ''{0}'' must be first statement in constructor body
zh_cn: 调用 ''{0}'' 必须是构造函数体中的第一个语句

source: Call to super is not allowed in enum constructor
zh_cn: 枚举构造函数中不允许调用 super

source: Callee Method
zh_cn: 被调用的方法

source: Callee Methods Hierarchy
zh_cn: 被调用方法的层次架构

source: Callees of {0}
zh_cn: {0} 的被调用者

source: Caller Method
zh_cn: 调用方法

source: Caller Methods Hierarchy
zh_cn: 调用方法的层次结构

source: Callers of {0}
zh_cn: {0} 的调用者

source: Camel prefixes in code completion
zh_cn: 在代码补全时使用驼峰前缀

source: Can accept &external connections
zh_cn: 可以接受外部连接(&E)

source: Can be replaced with ''{0}''
zh_cn: 可以替换为 ''{0}''

source: Can be replaced with ''{0}.{1}'' call
zh_cn: 可以替换为 ''{0}.{1}'' 调用

source: Can be replaced with 'Map.forEach'
zh_cn: 可以替换为 'Map.forEach'

source: Can be replaced with single ''Map.{0}'' method call
zh_cn: 可以用单个 ''Map.{0}'' 方法调用替换

source: Can be simplified
zh_cn: 可以简化

source: Can be simplified using ''{0}'' collector
zh_cn: 可以使用 ''{0}'' collector 来简化

source: Can be {0}
zh_cn: 可以为 {0}

source: Can have runtime value:\&nbsp;{0}
zh_cn: 可以有运行时值:\&nbsp;{0}

source: Can not find start section rule for the current end rule.
zh_cn: 找不到当前结束规则的开始部分规则。

source: Can not parse URL {0}
zh_cn: 无法解析 URL {0}

source: Can not parse URL, unhandled exception thrown
zh_cn: 无法解析 URL，抛出未处理的异常

source: Can not show diff
zh_cn: 不能显示差异

source: Can not show diff for unknown file type
zh_cn: 无法显示未知文件类型的差异

source: Can''t apply {0, number} of {1, number} hunks
zh_cn: 不能应用 {0, number} / {1, number} 块

source: Can''t apply {0, number} {0, choice, 1#hunk|2#hunks}
zh_cn: 不能应用 {0, number} 块

source: Can''t create properties file ''{0}'' because its name is associated with the {1}.
zh_cn: 不能创建属性文件 ''{0}''，因为它的名称与 {1} 相关联。

source: Can''t delete file {0}
zh_cn: 无法删除文件 {0}

source: Can''t load code style scheme {0}.
zh_cn: 无法加载代码样式方案 {0}。

source: Can''t read from {0}
zh_cn: 不能从 {0} 中读取

source: Can''t rename {0} to {1}
zh_cn: 无法将 {0} 重命名为 {1}

source: Can''t resolve property: {0}
zh_cn: 无法解析属性: {0}

source: Can''t save code style scheme {0}.
zh_cn: 无法保存代码样式方案 {0} 。

source: Can't Browse TestCase Inheritors
zh_cn: 不能浏览 TestCase 继承者
